In [77]:
import pandas as pd
data={
    'ID':[1,2,3,4,5],
    'Name':['Anu','Banu','Devi','Ravi','Veni'],
    'Gender':['F','F','F','M','F'],
    'Dept':['CSE','ECE','EEE','Mech','Civil'],
    'City':['Chennai','Trichy','Chennai','Madurai','Chennai']
     }
df=pd.DataFrame(data)
df

   ID  Name Gender   Dept     City
0   1   Anu      F    CSE  Chennai
1   2  Banu      F    ECE   Trichy
2   3  Devi      F    EEE  Chennai
3   4  Ravi      M   Mech  Madurai
4   5  Veni      F  Civil  Chennai

In [78]:
df.head(3)

   ID  Name Gender Dept     City
0   1   Anu      F  CSE  Chennai
1   2  Banu      F  ECE   Trichy
2   3  Devi      F  EEE  Chennai

In [79]:
df.tail(2)

   ID  Name Gender   Dept     City
3   4  Ravi      M   Mech  Madurai
4   5  Veni      F  Civil  Chennai

In [80]:
df.sample()

   ID  Name Gender   Dept     City
4   5  Veni      F  Civil  Chennai

In [81]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 5 entries, 0 to 4
Data columns (total 5 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   ID      5 non-null      int64
 1   Name    5 non-null      object
 2   Gender  5 non-null      object
 3   Dept    5 non-null      object
 4   City    5 non-null      object
dtypes: int64(1), object(4)
memory usage: 332.0+ bytes

In [82]:
df.describe()

             ID
count  5.000000
mean   3.000000
std    1.581139
min    1.000000
25%    2.000000
50%    3.000000
75%    4.000000
max    5.000000

In [83]:
df.shape

(5, 5)

In [84]:
df.dtypes

ID         int64
Name      object
Gender    object
Dept      object
City      object
dtype: object

In [85]:
df.isnull()

      ID   Name  Gender   Dept   City
0  False  False   False  False  False
1  False  False   False  False  False
2  False  False   False  False  False
3  False  False   False  False  False
4  False  False   False  False  False

In [86]:
df.notnull()

     ID  Name  Gender  Dept  City
0  True  True    True  True  True
1  True  True    True  True  True
2  True  True    True  True  True
3  True  True    True  True  True
4  True  True    True  True  True

In [87]:
df.nunique()

ID        5
Name      5
Gender    2
Dept      5
City      3
dtype: int64

In [88]:
df.value_counts('City')

City
Chennai    3
Madurai    1
Trichy     1
Name: count, dtype: int64

In [89]:
df['City'].unique()

array(['Chennai', 'Trichy', 'Madurai'], dtype=object)

In [90]:
df['Name']

0     Anu
1    Banu
2    Devi
3    Ravi
4    Veni
Name: Name, dtype: object

In [91]:
df.loc[3]

ID              4
Name         Ravi
Gender          M
Dept         Mech
City      Madurai
Name: 3, dtype: object

In [92]:
df.iloc[3]

ID              4
Name         Ravi
Gender          M
Dept         Mech
City      Madurai
Name: 3, dtype: object

In [93]:
df[df['ID']>3]

   ID  Name Gender   Dept     City
3   4  Ravi      M   Mech  Madurai
4   5  Veni      F  Civil  Chennai

In [94]:
df.dropna()

   ID  Name Gender   Dept     City
0   1   Anu      F    CSE  Chennai
1   2  Banu      F    ECE   Trichy
2   3  Devi      F    EEE  Chennai
3   4  Ravi      M   Mech  Madurai
4   5  Veni      F  Civil  Chennai

In [95]:
df.drop_duplicates()

   ID  Name Gender   Dept     City
0   1   Anu      F    CSE  Chennai
1   2  Banu      F    ECE   Trichy
2   3  Devi      F    EEE  Chennai
3   4  Ravi      M   Mech  Madurai
4   5  Veni      F  Civil  Chennai

In [96]:
df.rename(columns={'ID':'Stud ID'})

   Stud ID  Name Gender   Dept     City
0        1   Anu      F    CSE  Chennai
1        2  Banu      F    ECE   Trichy
2        3  Devi      F    EEE  Chennai
3        4  Ravi      M   Mech  Madurai
4        5  Veni      F  Civil  Chennai

In [97]:
df['ID'].astype(float)

0    1.0
1    2.0
2    3.0
3    4.0
4    5.0
Name: ID, dtype: float64

In [98]:
df['Name'].str.upper()

0     ANU
1    BANU
2    DEVI
3    RAVI
4    VENI
Name: Name, dtype: object

In [99]:
df['City'].str.contains('Madurai')

0    False
1    False
2    False
3     True
4    False
Name: City, dtype: bool

In [100]:
df1=df.replace('Devi', 'David')
df1

   ID   Name Gender   Dept     City
0   1    Anu      F    CSE  Chennai
1   2   Banu      F    ECE   Trichy
2   3  David      F    EEE  Chennai
3   4   Ravi      M   Mech  Madurai
4   5   Veni      F  Civil  Chennai

In [101]:
df2=df1.replace({'Veni':'Vinoth', 'EEE':'Civil'})
df2.loc[2, 'Gender']='M'
df2

   ID    Name Gender   Dept     City
0   1     Anu      F    CSE  Chennai
1   2    Banu      F    ECE   Trichy
2   3   David      M  Civil  Chennai
3   4    Ravi      M   Mech  Madurai
4   5  Vinoth      F  Civil  Chennai

In [102]:
df2.loc[4,'Gender']='M'
df2

   ID    Name Gender   Dept     City
0   1     Anu      F    CSE  Chennai
1   2    Banu      F    ECE   Trichy
2   3   David      M  Civil  Chennai
3   4    Ravi      M   Mech  Madurai
4   5  Vinoth      M  Civil  Chennai

In [103]:
df2['Age']=[19,20,21,18,20]
df2

   ID    Name Gender   Dept     City  Age
0   1     Anu      F    CSE  Chennai   19
1   2    Banu      F    ECE   Trichy   20
2   3   David      M  Civil  Chennai   21
3   4    Ravi      M   Mech  Madurai   18
4   5  Vinoth      M  Civil  Chennai   20

In [104]:
df=df2[['ID','Name','Gender','Age','Dept','City']]
df

   ID    Name Gender  Age   Dept     City
0   1     Anu      F   19    CSE  Chennai
1   2    Banu      F   20    ECE   Trichy
2   3   David      M   21  Civil  Chennai
3   4    Ravi      M   18   Mech  Madurai
4   5  Vinoth      M   20  Civil  Chennai

In [105]:
df['Age']=df['Age'].apply(lambda x: x + 1)
df

   ID    Name Gender  Age   Dept     City
0   1     Anu      F   20    CSE  Chennai
1   2    Banu      F   21    ECE   Trichy
2   3   David      M   22  Civil  Chennai
3   4    Ravi      M   19   Mech  Madurai
4   5  Vinoth      M   21  Civil  Chennai